fluid/annularThermalMixer/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "${FOAM_CASE}/constant/caseSettings"

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        $!calculated/alphat;
    }

    outlet
    {
        $!calculated/alphat;
    }

    movingWalls
    {
        $!wall/alphat;
    }

    staticWalls
    {
        $movingWalls;
    }

    nonCouple
    {
        type            zeroGradient;
    }

    nonCouple
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
